"use strict";
var __importDefault = (this && this.__importDefault) || function (mod) {
    return (mod && mod.__esModule) ? mod : { "default": mod };
};
Object.defineProperty(exports, "__esModule", { value: true });
exports.ProtectedLayout = void 0;
const antd_1 = require("antd");
const icons_1 = require("@ant-design/icons");
const SidebarRight_1 = __importDefault(require("./SidebarRight"));
const SidebarLeft_1 = __importDefault(require("./SidebarLeft"));
const modal_1 = __importDefault(require("../components/modal"));
const auth_1 = require("app/utils/auth");
const Loader_1 = require("app/components/Loader");
const foundation_module_css_1 = __importDefault(require("../styles/foundation.module.css"));
const react_1 = require("next-auth/react");
const dashboardApiContext_1 = require("app/context/dashboardApiContext");
const api_1 = require("app/utils/api");
const react_2 = require("react");
const { Content } = antd_1.Layout;
// @ts-ignore
const ProtectedLayout = ({ children }) => {
    var _a;
    const [open, setOpen] = (0, react_2.useState)(false);
    const [checked, setChecked] = (0, react_2.useState)(false);
    const [isModalOpen, setIsModalOpen] = (0, react_2.useState)(true);
    const [form] = antd_1.Form.useForm();
    const { status } = (0, react_1.useSession)();
    const { data: statusData } = api_1.api.loan.accountStatus.useQuery(undefined, {
        enabled: false,
    });
    const { data: dan } = api_1.api.loan.accountStatusDan.useQuery(undefined, {
        enabled: false,
    });
    (0, auth_1.useRequireAuth)();
    if (status == "loading") {
        return <Loader_1.Loaderr />;
    }
    function buttonClick() {
        window.open(dan.https_redirect, "_blank");
    }
    const toggleChecked = () => {
        setChecked(!checked);
    };
    const handleOk = async () => {
        await form.validateFields();
        toggleChecked();
        setIsModalOpen(false);
        setOpen(true);
    };
    return (<antd_1.Layout>
      <dashboardApiContext_1.ApiWrapper>
        <modal_1.default modalWidth={"70%"} open={((_a = statusData === null || statusData === void 0 ? void 0 : statusData.stat) === null || _a === void 0 ? void 0 : _a.valid_dan) == 0 && isModalOpen} closeModal={null} buttonText={null} iconPath={null} customIconWidth={null} customDiv={<div className="border-b border-black font-beau text-[16px] font-normal text-black">
              ҮЙЛЧИЛГЭЭНИЙ ЕРӨНХИЙ НӨХЦӨЛ
            </div>} closableM={"true"} textAlign={"start"} buttonClick={buttonClick} text={<>
              <div className="rounded-[20px] bg-[#1A21550D] p-[60px] font-beau font-light">
                <p className="text-center">НЭГ. НИЙТЛЭГ ҮНДЭСЛЭЛ</p>
                <br />
                1.1 Энэхүү Үйлчилгээний нөхцөлөөр “Фанд ми бирж” ХХК /цаашид
                “FUNDME” гэх/ -аас санал болгож байгаа цахим мөнгөний биржийн
                бүтээгдэхүүн, үйлчилгээг Хэрэглэгч авахтай холбоотой харилцааг
                зохицуулна. <br />
                <br />
                1.2 “FUNDME” апликейшн, веб сайтын худалдааны тэмдэгтүүд нь
                “ФАНД МИ БИРЖ” ХХК -ийн  өмч бөгөөд таних тэмдэг лого, нэр бусад
                загварыг хуулах, олшруулах, тараах, дуурайх, өөр бусад ямар
                нэгэн зүйлд ашиглахыг хориглоно. <br />
                <br />
                1.3 Хэрэглэгч гэдэг нь энэхүү Үйлчилгээний нөхцөл болон
                FUNDME-гийн бүтээгдэхүүн, үйлчилгээг авахаар бүртгүүлсэн иргэн
                хуулийн этгээдийг хэлнэ. <br />
                <br />
                1.4 Хуульд өөрөөр заагаагүй бол хэрэглэгч нь Монгол улсын 18
                насанд хүрсэн, иргэний эрх зүйн бүрэн чадамжтай иргэн болон
                хуулийн этгээд байж болно. <br />
                <br />
                1.5 Хэрэглэгч цахим мөнгөний биржийн системд дараах үйлдэл хийх
                боломжтой байна. <br />
                &nbsp;&nbsp;1.5.1 Нэвтрэх; <br />
                &nbsp;&nbsp;1.5.2 Үйлчилгээний нөхцөлтэй танилцаж зөвшөөрөх;{" "}
                <br />
                &nbsp;&nbsp;1.5.3 Бүртгүүлэх;
                <br />
                &nbsp;&nbsp;1.5.4 Санхүүжилт өгөх; <br />
                &nbsp;&nbsp;1.5.5 Зээл авах; <br />
                &nbsp;&nbsp;1.5.6 Тухайн үеийн технологийн шийдлээс хамаарсан
                бусад.
                <br />
                <br /> 1.6 Вэбсайт, апликейшнд байршуулсан аливаа урилга, санал,
                нөхцөлийг хүлээн зөвшөөрөх, баталгаажуулах үйлдэл хийсэн нь
                Хэрэглэгч “ФАНД МИ БИРЖ” ХХК-ын үйлчилгээний нөхцөлийг
                зөвшөөрсөнд тооцно. <br />
                <br />
                1.7 Иргэн вэбсайт, апликейшнд өөрийн бүртгэлтэй утасны дугаарыг
                оруулж өөрийн үүсгэсэн нууц үгээр нэвтрэнэ. <br />
                <br />
                1.8 Хуулийн этгээд “FUNDME” апликейшн болон вэбсайтад
                бүртгүүлэхэд дансны хуулгаар илгээсэн 4 оронтой гүйлгээний дүнг
                “БАТАЛГААЖУУЛАХ КОД” хэсэгт оруулан нэвтрэнэ.
                <br />
                <br />
                <br />
                <p className="text-center">
                  ХОЁР. АПЛИКЕЙШН БОЛОН ВЕБ САЙТЫН ҮЙЛ АЖИЛЛАГААНЫ НӨХЦӨЛ
                </p>{" "}
                <br />
                2.1 Цахим мөнгөний биржийн ажиллах хугацаа: 10:00 цагаас 14:00
                цагийн хооронд байна.
                <br />
                <br /> 2.2 Харилцагч та цахим мөнгөний биржэд санхүүжилт өгөх
                болон зээл авах захиалгыг оруулах ба таны захиалга хугацааны
                дарааллаар эрэмбэлэгдэнэ. <br />
                <br />
                2.3 Таны захиалга биелээгүй тохиолдолд “Фанд ми бирж” ХХК-тай
                гэрээ байгуулаагүйд тооцож хүсэлт тухайн өдөртөө цуцлагдана.
                <br /> <br />
                2.4 Санхүүжилт өгөх болон зээл авах захиалга нь тус бүрээр
                өөрийн нөхцөлтэй байна. <br />
                <br />
                2.5 Харилцагчидад дор дурдсан нөхцөлөөр санхүүгийн үйлчилгээ
                үзүүлнэ. Үүнд:
                <br />
                &nbsp;&nbsp; 2.5.1 Биржийн хүү: зах зээлийн нөхцөл байдлаас
                хамаарч тухай бүр автоматаар тохируулсан хүү байна.
                <br /> &nbsp;&nbsp;&nbsp;2.5.2 Хүү: Санхүүжилт өгсөн болон зээл
                авсан өдрөөс эхлэн хүүг жилийн 365 хоногоор тооцно. <br />
                &nbsp;&nbsp; 2.5.3 Зориулалт: Санхүүжилт өгөх болон зээл авах.{" "}
                <br />
                &nbsp;&nbsp; 2.5.4 Хэмжээ: <br />
                &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;2.5.4.1 Санхүүжилт өгөх дээд
                хэмжээ 500,000,000 /таван зуун сая/ төгрөг доод хэмжээ 5,000,000
                /таван сая/ төгрөг байна.
                <br /> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;2.5.4.2 Зээл авах хэмжээ нь
                “Фан дми бирж” ХХК-ны зээлийн судалгааны үндсэн дээр олгогдсон
                зээлийн эрхийн хүрээнд байна. <br />
                &nbsp;&nbsp; 2.5.5 Хугацаа: Санхүүжилт өгөх болон зээл авах
                хоног 7,14,21,28 хоногуудаас сонгоно. <br />
                &nbsp;&nbsp; 2.5.6 Хугацанаас өмнө өгсөн санхүүжилтыг цуцлах
                боломжгүй байна. <br />
                <br />
                <p className="text-center">ГУРАВ. ХЭРЭГЛЭГЧИЙН ЭРХ, ҮҮРЭГ</p>
                <br />
                3.1 Хэрэглэгч нь “FUNDME” апликейшн болон веб сайтад бүртгүүлэх
                үйлчилгээ авах зорилгоор өөрийн хувийн мэдээллийг “Фанд ми бирж”
                ХХК болон хамтран ажиллагч банкинд олгохыг сайн дурын үндсэн
                дээр зөвшөөрсөн болно.
                <br />
                <br />
                3.2 Хэрэглэгч апликейшн болон вэб сайтын ажиллагааны талаар
                санал гомдол, шинэ санаа, шинэ бараа борлуулах хүсэлт, шүүмж
                зэргийг энэхүү журмын дагуу чөлөөтэй илэрхийлэх, илгээх эрхтэй.
                <br />
                3.3 Өөрийн нууц үгийг алдалгүй, найдвартай хадгалах нь
                хэрэглэгчийн үүрэг байна.
                <br />
                <br />
                3.4 Өөрийн нууц үгээ өөрчлөх, шинэчлэх нь хэрэглэгчийн
                хариуцлага байна.
                <br />
                <br />
                3.5 Өөрийн нууц үгийг алдсанаас болон мэдээллийн нууцаа хадгалж
                чадаагүйгээс үүдэн гарсан асуудлын хариуцлагыг Үйлчилгээ
                үзүүлэгч хүлээхгүй.
                <br />
                <br />
                3.6 Хэрэглэгч нь Үйлчилгээ үзүүлэгчийн компьютерийн сүлжээ,
                сервер компьютерт хууль бусаар халдах, Үйлчилгээнд эвдрэл,
                саатал учруулах оролдлого хийхгүй байх үүрэгтэй.
                <br />
                <br />
                3.7 Хүсэлтийн дагуу илгээсэн мэдэгдэлийг тухай бүр шалгах
                үүрэгтэй.
                <br />
                <br />
                <p className="text-center">
                  ДӨРӨВ.ҮЙЛЧИЛГЭЭ ҮЗҮҮЛЭГЧИЙН ЭРХ, ҮҮРЭГ
                </p>
                <br />
                4.1 Үйлчилгээ үзүүлэгч нь цахим мөнгөний биржийн ажиллагаа,
                түүний аюулгүй байдал, хэрэглэгчдийн мэдээллийн нууцлалыг
                Компани болон тус апликейшн болон веб сайтын хөгжүүлэлт, систем
                ашиглалтыг хариуцаж буй компани  хамтран хариуцна.
                <br />
                <br />
                4.2 Харилцагчийн хүссэн санхүүжилтын талаархи мэдээллийг тухай
                бүр мэдэгдэх.
                <br />
                <br />
                4.3 Үйлчилгээ үзүүлэгч нь Хэрэглэгчийн мэдээлэлд шууд хандалт
                хийхгүй бөгөөд Хэрэглэгчийн зөвшөөрсөн урилгын дагуу
                Хэрэглэгчийн мэдээлэлд хандаж тусламж, зөвлөгөө өгнө.
                <br />
                <br />
                4.4 Үйлчилгээ үзүүлэгч нь Үйлчилгээний нөхцлийг өөрчлөн,
                шинэчлэх эрхтэй. Үйлчилгээний нөхцөлд өөрчлөлт хийсэн даруйд
                өөрчлөлтийн мэдэгдлийг Хэрэглэгчийн и-мэйл хаяг болон Мэдэгдэл
                цэсээр дамжуулан мэдэгдэнэ.
                <br />
                <br />
                4.5 Захиалгын талраахи мэдээллийг үнэ зөв, тодорхой,
                ойлгомжтойгоор апликейшн болон вэб сайтад байршуулж харуулна.{" "}
                <br />
                <br />
                <p>ТАВ. НУУЦЛАЛЫН БАТАЛГАА</p> <br />
                5.1 Харилцагч та “FUNDME” апликейшн болон веб сайтад
                бүртгүүлэсэнээр энэхүү баталгааны дагуу мэдээлэл цуглуулах болон
                ашиглахыг зөвшөөрсөнд тооцно.
                <br />
                <br />
                5.2 Хэрэглэгч системд бүртгүүлэх үед утасны дугаар, цахим
                шуудангийн хаяг, фэйсбүүк хаяг болон хэрэглэгчийн үүсгэсэн нууц
                үг системд хадгалагдана. Хэрэглэгчийн оруулсан нууц үгийг систем
                шифрлэн кодчилж хадгалах учир хэрэглэгчээс өөр хэн ч нууц үгийг
                мэдэх боломжгүй юм.
                <br />
                <br />
                5.3 Хэрэглэгч хувийн мэдээллээ оруулах болон ДАН системээр
                дамжуулах үед мэдээлэл системд хадгалагдана. Үүнд:  <br />
                &nbsp;&nbsp; 5.3.1 Овог, нэр <br />
                &nbsp;&nbsp; 5.3.2 Регистрийн дугаар <br />
                &nbsp;&nbsp; 5.3.3 Төрсөн он сар өдөр
                <br />
                &nbsp;&nbsp; 5.3.4 Хүйс <br />
                &nbsp;&nbsp; 5.3.5 Гэрийн хаяг <br />
                &nbsp;&nbsp; 5.3.6 Утасны дугаар <br />
                &nbsp;&nbsp; 5.3.7 И-мэйл хаяг <br />
                &nbsp;&nbsp; 5.3.8 Банкны данс <br />
                &nbsp;&nbsp; 5.3.9 Иргэний үнэмлэхний зураг гэх мэт ерөнхий
                мэдээллүүдийг хэрэглэгч “Хувийн мэдээлэл” хэсгээр бүртгэж
                хадгалдаг. <br />
                <br />
                5.4 Системийн үндсэн зааварчилгааны дагуу хэрэглэгчийн оруулсан
                мэдээлэл нь хэрэглэгчийн өмч бөгөөд “FUNDME” апликейшн болон вэб
                сайтын хэрэглэгчийн зөвшөөрөлгүйгээр дор дурдсан нөхцөлөөс бусад
                хэлбэрээр ашиглахгүй болно. Үүнд:          <br />
                &nbsp;&nbsp; 5.4.1 Таны гар утсанд холбогдох,
                <br />
                &nbsp;&nbsp; 5.4.2 Цахим шууданд мэдээлэл илгээх гэх мэт <br />
                <br />
                <p className="text-center">ЗУРГАА. ХАРИУЦЛАГА</p>
                <br />
                6.1 FUNDME нь дараах тохиолдолд Хэрэглэгчийн үйлчилгээг
                хязгаарлах эрхтэй бөгөөд түүнээс үүдэн гарах аливаа үр дагавар,
                хариуцлагыг Хэрэглэгч дангаар хүлээж учруулсан хохирлыг
                барагдуулна. Үүнд:
                <br />
                &nbsp;&nbsp; 6.1.1 Хэрэглэгч нь FUNDME-гийн вэбсайт, болон
                апликейшныг ашиглан FUNDME болон бусад сүлжээ, серверт
                зөвшөөрөлгүй нэвтрэх, халдах оролдлого гаргах, хууль бус үйл
                ажиллагаанд ашиглахаар завдах, эсхүл хууль бус үйл ажиллагаанд
                нэгтгэх;
                <br />
                &nbsp;&nbsp; 6.1.2 Хэрэглэгч нь FUNDME-гийн бүтээгдэхүүн,
                үйлчилгээг гуравдагч этгээдэд ашиглуулсан, зохих журмын дагуу
                ашиглаагүй, ажиллуулаагүй, нэвтрэх нэр, нууц үг, хэрэглэгчийн
                бүртгэлээ алдсан, задруулсан эсхүл хууль бус үйл ажиллагаанд
                ашигласан.
                <br />
                &nbsp;&nbsp; 6.1.3 Хэрэглэгчийн зохисгүй хэрэглээ, хайхрамжгүй
                үйлдлээс шалтгаалсан хохирлыг FUNDME хариуцахгүй.
                <br />
                &nbsp;&nbsp; 6.1.4 Хэрэглэгч нь нэвтрэх нэр, нууц үгээ гуравдагч
                этгээдэд ашиглуулсан, гуравдагч этгээдийн программ, үйлчилгээг
                татаж, хууль бус зорилгоор ашигласан, хэрэглэснээс үүдэн гарах
                аливаа үр дагавар, хохирол, зардлыг дангаар хариуцна.
                <br />
                &nbsp;&nbsp; 6.1.5 Газар хөдлөлт, аянга цахилгаан, үерийн
                гамшиг, шуурга, байгалийн гамшиг зэрэг давагдашгүй хүчин зүйл
                болон гоц халдварт өвчин, дайн, террорист халдлага, хязгаарлалт,
                төрийн эрх бүхий байгууллагын шийдвэр, хорио, цээр, бүх нийтийг
                хамарсан сүлжээний хэт их ачаалал, доголдол, зэрэг Хэрэглэгч
                болон FUNDME-гийн хүсэл зоригоос үл хамаарах, урьдчилан
                таамаглах боломжгүй хүчин зүйлээс шалтгаалан Фанд ми бирж ХХК
                гэрээгээр хүлээсэн үүргээ биелээгүй буюу зохих ёсоор
                биелүүлээгүй тохиолдолд Фанд ми бирж ХХК хариуцлага хүлээхгүй.
                <br />
                <br />
                6.2 Хэрэглэгч нэвтрэх нэр, нууц үгээ алдсан тохиолдолд 72229911
                FUNDME -гийн дугаарт мэдэгдэж үйлчилгээг хаалгана. Үүнээс үүдэн
                гарах хариуцлагыг Хэрэглэгч дангаараа хүлээнэ.
                <br />
                <br />
                6.3 FUNDME эсхүл Хэрэглэгч Үйлчилгээний нөхцөл болон гэрээнд
                заасан үүргээ нэг буюу түүнээс дээш удаа ноцтой зөрчсөн
                тохиолдолд буруугүй талын гэрээг цуцалж, учирсан хохирлыг
                буруутай этгээдээс шаардах эрхтэй.{" "}
              </div>
              <antd_1.Form form={form}>
                <antd_1.Row justify="center">
                  <antd_1.Col span={24}>
                    <antd_1.Form.Item name="agreement" valuePropName="checked" rules={[
                {
                    validator: (_, value) => value
                        ? Promise.resolve()
                        : Promise.reject(new Error("Та үйлчилгээний нөхцөл зөвшөөрөөгүй байна.")),
                },
            ]}>
                      <antd_1.Checkbox>
                        <div className={foundation_module_css_1.default["foundation-checkbox-text"]}>
                          Зээлийн үйлчилгээний нөхцөл
                        </div>
                      </antd_1.Checkbox>
                    </antd_1.Form.Item>
                  </antd_1.Col>
                  <antd_1.Col span={24}>
                    <antd_1.Row justify="space-between">
                      <antd_1.Col flex="none">
                        <antd_1.Button className={foundation_module_css_1.default["foundation-button-back"]}>
                          <div className={foundation_module_css_1.default["foundation-button-back-text"]}>
                            Буцах
                          </div>
                        </antd_1.Button>
                      </antd_1.Col>
                      <antd_1.Col flex="none">
                        <antd_1.Form.Item>
                          <antd_1.Button type="primary" className={`${foundation_module_css_1.default["foundation-button-contiune"]} bg-primary`} onClick={handleOk} htmlType="submit">
                            <icons_1.CalculatorOutlined />
                            Үргэлжлүүлэх
                          </antd_1.Button>
                        </antd_1.Form.Item>
                      </antd_1.Col>
                    </antd_1.Row>
                  </antd_1.Col>
                </antd_1.Row>
              </antd_1.Form>
            </>}/>
        {!isModalOpen && (<modal_1.default modalWidth={null} textAlign={null} open={open} closeModal={null} buttonText={"Үргэлжлүүлэх"} iconPath={"/images/e-mongolia"} customIconWidth={278} customDiv={null} closableM={"false"} buttonClick={buttonClick} text={"Харилцагч та зээлийн эрхийн хэмжээгээ өөрт ойр байрлах салбар нэгжид хандан нээлгэнэ үү."}/>)}
        <SidebarLeft_1.default />
        <antd_1.Layout>
          <Content>{children}</Content>
        </antd_1.Layout>
        <SidebarRight_1.default />
      </dashboardApiContext_1.ApiWrapper>
    </antd_1.Layout>);
};
exports.ProtectedLayout = ProtectedLayout;
